Repository: Muslima2411/ibrat_debate_scanner_app
Catalog: lib/src/common/l10n/intl_*.arb
Languages: uz

source: Home
uz: Bosh sahifa

source: Time
uz: Vaqt

source: Profile
uz: Profil

# qrScannerTitle
source: QR Scanner
uz: QR kod skaneri

# qrScannerSubtitle
source: Tap the button to scan a QR code
uz: QR kodni skanerlash uchun tugmani bosing

source: Open Scanner
uz: Skanerni ochish

source: Welcome
uz: Xush kelibsiz

source: Debates
uz: Debatlar

source: Location
uz: Joylashuv

source: Topic
uz: Mavzu

source: Upcoming
uz: Kutilayotgan

source: Ongoing
uz: Davom etayotgan

source: Completed
uz: Tugallangan

source: Cancelled
uz: Bekor qilingan

source: View Details
uz: Batafsil ko'rish

source: Viewing Details
uz: Ko'rilmoqda

source: Share
uz: Ulashish

source: Sharing
uz: Ulashilmoqda

source: Status
uz: Holat

source: Log out
uz: Chiqish

source: Settings
uz: Sozlamalar

source: Language
uz: Til

source: Theme
uz: Mavzu

source: Timer
uz: Taymer

source: Choose language
uz: Tilni tanlang

# chooseTheme
source: Choose theme mode
uz: Mavzuni tanlash

source: Select
uz: Tanlash

# loginTitle
source: Login
uz: Kirish

# loginSubtitle
source: Enter your credentials to log in
uz: Kirish uchun maʼlumotlaringizni kiriting

source: Email
uz: Elektron pochta

source: Password
uz: Parol

# loginButton
source: Log In
uz: Kirish

# invalidCredentials
source: Invalid username or password
uz: Noto‘g‘ri login yoki parol

source: Username
uz: Foydalanuvchi nomi

source: Phone
uz: Telefon

source: Change Password
uz: Parolni o'zgartirish

source: Save
uz: Saqlash

# savedSuccessfully
source: Settings saved successfully!
uz: Sozlamalar muvaffaqiyatli saqlandi!

# profileInfo
source: Profile Information
uz: Profil maʼlumotlari

source: Light
uz: Yorqin

source: Dark
uz: Qorong'u

source: Statistics
uz: Statistika

# empty_page
source: This page is empty
uz: Bu sahifa bo'sh

# scanned_qr_code
source: QR Code Scanned
uz: QR kod skanerlendi

# successfully_scanned
source: Successfully scanned QR code:
uz: QR kod muvaffaqiyatli skanerlendi:

# wanna_use
source: Do you want to use this QR code?
uz: Ushbu QR kodni ishlatmoqchimisiz?

source: Scan again
uz: Qayta skaner qilish

source: Confirm
uz: Tasdiqlash

# camera_position
source: Position the QR code within the frame to scan
uz: QR kodni skaner qilish uchun ramka ichiga joylashtiring

source: Camera Error:
uz: Kamera xatosi:

source: Go Back
uz: Orqaga qaytish

# scan_appbar
source: Scan QR
uz: QR skaner

# error_restarting_qrScanner
source: Error restarting camera:
uz: Kamerani qayta ishga tushirishda xato:

# logout_title
source: Confirm Logout
uz: Chiqishni tasdiqlang

# logout_message
source: Are you sure you want to log out of your account?
uz: Hisobingizdan chiqishni xohlaysizmi?

# confirm_log_out
source: Yes, Log Out
uz: Ha, chiqish

source: Cancel
uz: Bekor qilish

# no_data
source: No data available yet
uz: Hozircha hech qanday ma'lumot yo'q

source: Current Password
uz: Joriy parol

source: New Password
uz: Yangi parol

source: User Info
uz: Foydalanuvchi haqida

source: Ticket Info
uz: Chipta haqida

source: Name
uz: Ism

source: Age Group
uz: Yosh toifasi

source: Ticket ID
uz: Chipta ID

source: Debate ID
uz: Munozara ID

# confirm_checkin_prompt
source: Do you want to confirm check-in for this user?
uz: Ushbu foydalanuvchini roʻyxatdan oʻtkazishni tasdiqlaysizmi?

source: Processing ticket...
uz: Chipta qayta ishlanmoqda...

# returning_previous_page
source: Returning to previous page...
uz: Oldingi sahifaga qaytish...

# success_title
source: Check-in Successful
uz: Kirish muvaffaqiyatli

# success_message
source: The user has been successfully checked in.
uz: Foydalanuvchi muvaffaqiyatli roʻyxatdan oʻtdi.

# statistics_not_available_yet
source: Statistics are not available yet...
uz: Statistika hali mavjud emas...

source: Age
uz: Yosh

source: English Level
uz: Ingliz tili darajasi

# enter_name
source: Enter your name
uz: Ismingizni kiriting

source: History
uz: Tarix

# no_history
source: No history available
uz: Tarix mavjud emas

source: Clear
uz: Tozalash

# cancel_ticket_q
source: Cancel Ticket?
uz: Chipta bekor qilinsinmi?

source: Cancel Ticket
uz: Chipta bekor qilish

# are_u_sure_cancel
source: Are you sure you want to cancel this ticket?
uz: Ushbu chipta bekor qilinishini xohlaysizmi?

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Close
uz: Yopish

source: Region
uz: Viloyat

source: District
uz: Tuman

source: Checked At
uz: Tekshirildi

source: Date
uz: Sana

source: Ticket Information
uz: Chipta ma'lumotlari

source: Clear All
uz: Barchasini tozalash

source: Apply
uz: Qo'llash

source: All Districts
uz: Barcha tumanlar

# select_region_first
source: Select a region first
uz: Avval viloyatni tanlang

source: All Regions
uz: Barcha viloyatlar

source: Select Region
uz: Viloyatni tanlang

source: Pending Only
uz: Faqat kutayotganlar

source: Checked Only
uz: Faqat tekshirilganlar

source: All
uz: Hammasi

source: Filter Tickets
uz: Chiptalarni filtrlash

source: Loading tickets...
uz: Chiptalar yuklanmoqda...

source: No tickets found
uz: Hech qanday chipta topilmadi

source: Pending
uz: Kutilmoqda

source: Checked
uz: Tekshirilgan

source: Created At
uz: Yaratilgan vaqti

source: Loading statistics...
uz: Statistika yuklanmoqda...

# pls_select_region
source: Please select a region
uz: Iltimos, viloyatni tanlang

source: Metric
uz: Ko‘rsatkich

source: Count
uz: Hisob

source: Total Registered
uz: Jami ro'yxatdan o'tganlar

source: Attendance Rate
uz: Qatnashish darajasi

# pls_select_region_stats
source: Please select a region to view statistics
uz: Statistikani ko‘rish uchun iltimos, viloyatni tanlang

# found_tickets_with_filters
source: Found ${count} tickets â€¢ ${filters}
uz: ${count} ta chipta topildi • ${filters}

source: Unknown User
uz: Noma'lum foydalanuvchi

# contact_info
source: Contact Information
uz: Aloqa ma'lumotlari

source: Attended
uz: Qatnashdi

# event_info
source: Event Information
uz: Tadbir haqida ma'lumot

# cancel_ticket_title
source: Cancel Ticket?
uz: Chiptani bekor qilasizmi?

# cancel_ticket_confirmation
source: Are you sure you want to cancel this ticket? This action cannot be undone.
uz: Ushbu chiptani bekor qilmoqchimisiz? Bu amal qaytarib bo'lmaydi.

source: Keep Ticket
uz: Chiptani saqlash
